; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph3 - mode
	spectrograph0 - mode
	image2 - mode
	thermograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation12 - direction
	Star14 - direction
	Star13 - direction
	GroundStation11 - direction
	Star9 - direction
	Star7 - direction
	Star6 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star10 - direction
	Star3 - direction
	GroundStation8 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet19)
	(supports instrument3 spectrograph0)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star7)
	(supports instrument6 thermograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star10)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite1 Star9)
	(have_image Planet15 image2)
	(have_image Planet16 image2)
	(have_image Star17 image2)
	(have_image Star18 thermograph1)
	(have_image Planet19 thermograph3)
	(have_image Star20 thermograph3)
	(have_image Planet21 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 planet19 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet19)
   goals met: 0 of 8
5. (take_image satellite0 planet19 instrument1 thermograph3)
   added: (have_image planet19 thermograph3)
   goals met: 1 of 8
6. (turn_to satellite0 planet16 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet16)
   goals met: 1 of 8
7. (take_image satellite0 planet16 instrument1 image2)
   added: (have_image planet16 image2)
   goals met: 2 of 8
8. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 2 of 8
9. (take_image satellite0 planet15 instrument1 image2)
   added: (have_image planet15 image2)
   goals met: 3 of 8
10. (turn_to satellite0 planet21 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet21)
   goals met: 3 of 8
11. (take_image satellite0 planet21 instrument1 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 4 of 8
12. (turn_to satellite0 star17 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star17)
   goals met: 4 of 8
13. (take_image satellite0 star17 instrument1 image2)
   added: (have_image star17 image2)
   goals met: 5 of 8
14. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 5 of 8
15. (take_image satellite0 star18 instrument1 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 6 of 8
16. (turn_to satellite0 star20 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star20)
   goals met: 6 of 8
17. (take_image satellite0 star20 instrument1 thermograph3)
   added: (have_image star20 thermograph3)
   goals met: 7 of 8
18. (turn_to satellite1 star9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star9)
   goals met: 8 of 8
